#------------------
#sequencing

#ნიშნავს როდესაც კოდი ერთმანეთის მიყოლებით სრულდება 
#ამის მაგალითი ასეთი შეიძლება იყოს:

#მანქანის დაქოქვა  
#სიჩქარეში ჩაგდება  
#გაზის პედალი   
#და წასვლა

#------------------
#iteration

#კოდის გამეორება სანამ იმას არ მივიღებთ რაც გვჭირდება
#ამის მაგალითი ასეთი შეიძლება იყოს:

#როდესაც მანქანის 4 ივე ბორბლის გამოცვლა გვინდა
#ერთდროულად 4 ივეს ვერ გამოცვლი, ჯერ პირველი მერე მეორე და
#ასე შემდეგ ეს შეიძლება იყოს იტერაცია

#------------------
#selection

#როდესაც ჩვენი კოდი გადაწყვეტილებებს იღებს
#ამის მაგალითი ასეთი შეიძლება იყოს:

#თუ ძრავის ტემპერატურა 100°C-ზე მეტია ჩართე რადიატორის ვენტილატორი
#სხვა შემთხვევაში ჯერ არაფერია გასაგრილებელი

